using System;
using System.IO;

namespace MhyunBox.Services;

public static class SolutionFile
{
	public const string DefaultContent = "同时这里具备使用教程(对于动手能力较差必读，务必强制自己读完再去操作)\n如你所见已经启动了该脱盒程序，在左侧自上往下第二个是账号绑定在首页的下面，里面有账密，手机号相关网易与4399登录\n绑定完成后(自动登录保存需自己点击启动)，可以点击下一个栏目按钮(第三个)代理启动，里面有启动代理和各种方便按钮\n代理启动按钮左侧的数字初始是25560(一开始版本测试端口连着一起打包进来了)也可修改\n当然这只是代理教学在程序左下角设置里有很丰富的自定义方式，推荐你去探索和摸索\n端口号原理是自下(25560)而上+1(变大增加)的即第一个账号第一个角色后绑定的账号角色占用(绑定调用)的端口往上如:\n\nxxxx@163.com 角色A ->25560\n             角色B -> 25561\n             角色C -> 25562\nxxxx@qq.com\n             ...以此类推\n\n解决方案\n\n1.资源包相关问题\n如游戏内界面白/黑/马赛克丢失之类建议是用资源更新器更新(可能有时没更新最近相关资源)或从全部选择替换，快则30分钟内Done\n官方网易启动器(推荐但比较繁琐麻烦)直接扒最新资源包(DragonCore/ResourceCache两个选中后Ctrl+C)一起粘贴到自己的PCL的游戏版本资源包里如↓:\n(Esc -> 设置 -> 左下角资源包(左最下，第一列第五行) -> 打开资源包文件夹(左边))然后点中PCL(自己的游戏同步骤打开)资源包目录里->(Ctrl+V)\n\n2.代理模组问题\n在账号绑定加入了可以选中PCL程序并打开相关版本mods文件夹，在此仅一个提醒\n先排查是否模组问题与代理冲突导致出现Internet异常 IOEx..相关和[Proxy]等等\n如果正确使用了对应客户端还是进不去服务器务必打包日志发送给底部QQ\n\n2.1代理相关问题\n如出现持续一直连接中断/中止 此类问题可尝试从账号绑定清除会话记录(清掉本地账号记录)\n然后重新登录账号进入服务器查看是否问题解决，如还是出现此问题则再尝试换网络和重启电脑\n还是解决不了请打开代理启动的抓包目录并按以下步骤操作(第一种:)\n打开后目录以C盘为例如(C:\\...\\盒子所在目录\\ProxyCaptures\\)\n回到盒子所在目录会选中ProxyCaptures此文件夹，然后将ProxyCaptures此文件夹右键压缩\n(第二种:)可以打开抓包目录后在此目录再创建一个文件夹，将所有的log文件夹选中拖进去后压缩\n将此文件夹打包发送给以下:\n\n3529826211/2998155760\n以上QQ人物网名带Notel仅此\n(切勿将抓包日志发送给任何人!!!)";

	public static string FilePath => Path.Combine(AppContext.BaseDirectory, "解决方案.txt");

	public static void EnsureCreated()
	{
		if (!File.Exists(FilePath))
		{
			File.WriteAllText(FilePath, "同时这里具备使用教程(对于动手能力较差必读，务必强制自己读完再去操作)\n如你所见已经启动了该脱盒程序，在左侧自上往下第二个是账号绑定在首页的下面，里面有账密，手机号相关网易与4399登录\n绑定完成后(自动登录保存需自己点击启动)，可以点击下一个栏目按钮(第三个)代理启动，里面有启动代理和各种方便按钮\n代理启动按钮左侧的数字初始是25560(一开始版本测试端口连着一起打包进来了)也可修改\n当然这只是代理教学在程序左下角设置里有很丰富的自定义方式，推荐你去探索和摸索\n端口号原理是自下(25560)而上+1(变大增加)的即第一个账号第一个角色后绑定的账号角色占用(绑定调用)的端口往上如:\n\nxxxx@163.com 角色A ->25560\n             角色B -> 25561\n             角色C -> 25562\nxxxx@qq.com\n             ...以此类推\n\n解决方案\n\n1.资源包相关问题\n如游戏内界面白/黑/马赛克丢失之类建议是用资源更新器更新(可能有时没更新最近相关资源)或从全部选择替换，快则30分钟内Done\n官方网易启动器(推荐但比较繁琐麻烦)直接扒最新资源包(DragonCore/ResourceCache两个选中后Ctrl+C)一起粘贴到自己的PCL的游戏版本资源包里如↓:\n(Esc -> 设置 -> 左下角资源包(左最下，第一列第五行) -> 打开资源包文件夹(左边))然后点中PCL(自己的游戏同步骤打开)资源包目录里->(Ctrl+V)\n\n2.代理模组问题\n在账号绑定加入了可以选中PCL程序并打开相关版本mods文件夹，在此仅一个提醒\n先排查是否模组问题与代理冲突导致出现Internet异常 IOEx..相关和[Proxy]等等\n如果正确使用了对应客户端还是进不去服务器务必打包日志发送给底部QQ\n\n2.1代理相关问题\n如出现持续一直连接中断/中止 此类问题可尝试从账号绑定清除会话记录(清掉本地账号记录)\n然后重新登录账号进入服务器查看是否问题解决，如还是出现此问题则再尝试换网络和重启电脑\n还是解决不了请打开代理启动的抓包目录并按以下步骤操作(第一种:)\n打开后目录以C盘为例如(C:\\...\\盒子所在目录\\ProxyCaptures\\)\n回到盒子所在目录会选中ProxyCaptures此文件夹，然后将ProxyCaptures此文件夹右键压缩\n(第二种:)可以打开抓包目录后在此目录再创建一个文件夹，将所有的log文件夹选中拖进去后压缩\n将此文件夹打包发送给以下:\n\n3529826211/2998155760\n以上QQ人物网名带Notel仅此\n(切勿将抓包日志发送给任何人!!!)");
		}
	}

	public static string Load()
	{
		EnsureCreated();
		try
		{
			return File.ReadAllText(FilePath);
		}
		catch
		{
			return "";
		}
	}

	public static void Save(string content)
	{
		EnsureCreated();
		File.WriteAllText(FilePath, content ?? "");
	}
}
